{"title": ["Public Network Terms of Service - Stack Overflow"], "script": ["https://cdn.sstatic.net/", "{\"options\":{\"locale\":\"en\",\"serverTime\":1686683859,\"routeName\":\"Legal/PublicToS\",\"stackAuthUrl\":\"https://stackauth.com\",\"networkMetaHostname\":\"meta.stackexchange.com\",\"site\":{\"name\":\"Stack Overflow\",\"description\":\"Q\\u0026A for professional and enthusiast programmers\",\"isNoticesTabEnabled\":true,\"enableNewTagCreationWarning\":true,\"insertSpaceAfterNameTabCompletion\":false,\"id\":1,\"cookieDomain\":\".stackoverflow.com\",\"childUrl\":\"https://meta.stackoverflow.com\",\"negativeVoteScoreFloor\":null,\"enableSocialMediaInSharePopup\":true,\"protocol\":\"https\"},\"user\":{\"fkey\":\"f013da0d9f43a71cc1cd279a4fb8a28dc102d4389005b0dcbff058cb39628cfc\",\"tid\":\"54a070f2-3c0b-75ba-2bf0-34e4e6fb7d45\",\"rep\":0,\"isAnonymous\":true,\"isAnonymousNetworkWide\":true,\"ab\":{\"collectives_survey\":{\"v\":\"coso_survey\",\"g\":1}}},\"events\":{\"postType\":{\"question\":1},\"postEditionSection\":{\"title\":1,\"body\":2,\"tags\":3}}}}", "{\"settings\":{\"userMessaging\":{\"showNewFeatureNotice\":true},\"tags\":{},\"subscriptions\":{\"defaultBasicMaxTrueUpSeats\":250,\"defaultFreemiumMaxTrueUpSeats\":50,\"defaultMaxTrueUpSeats\":1000},\"snippets\":{\"renderDomain\":\"stacksnippets.net\",\"snippetsEnabled\":true},\"site\":{\"allowImageUploads\":true,\"enableImgurHttps\":true,\"enableUserHovercards\":true,\"forceHttpsImages\":true,\"stacksEditorPreviewEnabled\":true,\"styleCode\":true},\"search\":{},\"questions\":{\"enableQuestionTitleLengthLiveWarning\":true,\"enableSavesFeature\":true,\"maxTitleSize\":150,\"questionTitleLengthStartLiveWarningChars\":50},\"intercom\":{\"appId\":\"inf0secd\",\"hostBaseUrl\":\"https://stacksnippets.net\"},\"paths\":{\"jQueryUICSSPath\":\"https://ajax.googleapis.com/ajax/libs/jqueryui/1.12.0/themes/smoothness/jquery-ui.css\",\"jQueryUIJSPath\":\"https://ajax.googleapis.com/ajax/libs/jqueryui/1.12.0/jquery-ui.min.js\"},\"mentions\":{\"maxNumUsersInDropdown\":50},\"markdown\":{\"enableTables\":true},\"legal\":{\"oneTrustConfigId\":\"c3d9f1e3-55f3-4eba-b268-46cee4c6789c\"},\"flags\":{\"allowRetractingCommentFlags\":true,\"allowRetractingFlags\":true},\"elections\":{\"opaVoteResultsBaseUrl\":\"https://www.opavote.com/results/\"},\"comments\":{},\"accounts\":{\"currentPasswordRequiredForChangingStackIdPassword\":true}}}", "StackExchange.init();", "StackExchange.using.setCacheBreakers({\"Js/adops.en.js\":\"6da43f5e0a84\",\"Js/ask.en.js\":\"\",\"Js/begin-edit-event.en.js\":\"20edbaccceae\",\"Js/copy-transpiled.en.js\":\"2e27bf6a799c\",\"Js/events.en.js\":\"\",\"Js/explore-qlist.en.js\":\"2b1f34938b8b\",\"Js/full-anon.en.js\":\"b057cc6384f8\",\"Js/full.en.js\":\"c7942bddca94\",\"Js/highlightjs-loader.en.js\":\"036aae3dd40c\",\"Js/inline-tag-editing.en.js\":\"8a038866f9a6\",\"Js/keyboard-shortcuts.en.js\":\"107c2ac31497\",\"Js/markdown-it-loader.en.js\":\"5818ef89ff9d\",\"Js/mentions-transpiled.en.js\":\"aaeac2684aa8\",\"Js/moderator.en.js\":\"f7a4ba785325\",\"Js/postCollections-transpiled.en.js\":\"216ffeda5016\",\"Js/post-validation.en.js\":\"d62aa8a95b00\",\"Js/question-editor.en.js\":\"\",\"Js/review-v2-transpiled.en.js\":\"6010e419f0e9\",\"Js/revisions.en.js\":\"e6acc03fd5b5\",\"Js/stacks-editor.en.js\":\"861d60735da7\",\"Js/tageditor.en.js\":\"e5db6df2411b\",\"Js/tageditornew.en.js\":\"cebacb19d403\",\"Js/tagsuggestions.en.js\":\"bd6ec908f2a7\",\"Js/unlimited-transpiled.en.js\":\"7ed67670b600\",\"Js/wmd.en.js\":\"e88b27fdc1bc\",\"Js/snippet-javascript-codemirror.en.js\":\"73fce5cc7219\"});\r\n        StackExchange.using(\"gps\", function() {\r\n             StackExchange.gps.init(false);\r\n        });", "StackExchange.ready(function () { StackExchange.topbar.init(); });\r\n\t\tStackExchange.scrollPadding.setPaddingTop(50, 10);", "StackExchange.ready(function () {\r\n            StackExchange.Notice.announcementBannerInit();\r\n        });", "window.dataLayer = window.dataLayer || [];\r\n                function gtag() { dataLayer.push(arguments); }", "StackExchange.ready(function() {\r\n\r\n                var ga3Settings = {\r\n                    autoLink: [\"stackoverflow.blog\",\"info.stackoverflowsolutions.com\",\"stackoverflowsolutions.com\"],\r\n                    sendTitles: true,\r\n                    tracker: window.ga,\r\n                    trackingCodes: [\r\n                        'UA-108242619-1'\r\n                    ],\r\n                    checkDimension: 'dimension42'\r\n                                                    };\r\n\r\n                var customGA4Dimensions = {};\r\n\r\n\r\n                var ga4Settings = {\r\n                    tracker: gtag,\r\n                    trackingCodes: [\r\n                        'G-WCZ03SZFCQ'\r\n                    ],\r\n                    consentsToPerformanceCookies: \"denied\",\r\n                    consentsToTargetingCookies: \"denied\",\r\n                    eventParameters: customGA4Dimensions,\r\n                    checkForAdBlock: true\r\n                };\r\n\r\n                StackExchange.ga.init({ GA3: ga3Settings, GA4: ga4Settings });\r\n\r\n\r\n\r\n\r\n                StackExchange.ga.setDimension('dimension3', 'Legal/PublicToS');\r\n\r\n\r\n                StackExchange.ga.setDimension('dimension7', \"1686683859.151213368\");\r\n\r\n                StackExchange.ga.trackPageView();\r\n            });"], "noscript": ["body,.s-topbar{margin-top:1.9em}"], "style": ["body,.s-topbar{margin-top:1.9em}"], "span": ["Stack Overflow", "Stack Overflow", "Public questions & answers", "Stack Overflow for Teams", "Where developers & technologists share private knowledge with coworkers", "Talent", "Build your employer brand", "Advertising", "Reach developers & technologists worldwide", "Stack Overflow", "Meta Stack Overflow", "Questions", "Explore Collectives", "CC BY-SA", "rev 2023.6.13.43492"], "a": ["About", "Products", "For Teams", "About the company", "current community", "help", "chat", "Sign up", "log in", "more stack exchange communities", "company blog", "Log in", "Sign up", "2023 Developer Survey results", "Create a free Team", "Why Teams?", "Learn more about Collectives", "Learn more about Teams", "Public Network Terms of Service", "Free", "Basic", "Business", "API Terms of Use", "Agency IAB Terms", "Advertiser IAB Terms", "Employer Branding Agreement", "Privacy Policy", "Teams: Free, Basic & Business", "Teams, Enterprise", "Collectives", "Integrations", "Microsoft Teams - Teams: Free, Basic & Business", "Microsoft Teams - Teams, Enterprise", "Slack - Teams: Free, Basic & Business", "Slack - Teams, Enterprise", "Jira - Teams, Business", "Jira - Teams, Enterprise", "Talent", "General Data Protection Regulation (GDPR)", "Subprocessors", "Stack Overflow for Teams Data Processing Addendum", "Collectives Joint Controller Agreement", "Cookie Policy", "Acceptable Use Policy", "Trademark Guidance", "Digital Services Act", "Contact", "Submit Data Request", "Public Network Terms", "Contracts are Binding and Legally Enforcable  – Please Read!", "Age Eligibility", "Access to the Public Network", "User Obligations", "Content Permissions, Restrictions, and Creative Commons Licensing", "Disclaimer of Warranties", "Indemnification", "Limitation of Liability", "General Provisions", "Copyright policy", "Acceptable Use Policy", "Privacy Policy", "Privacy Policy", "“Content Permissions, Restrictions, and Creative Commons Licensing,”", "Privacy Policy", "Acceptable Use Policy", "API Terms of Use", "CC BY-SA 4.0", "Creative Commons", "explained in further detail here", "“Public Network Terms”", "“Contracts are Binding and Legally Enforceable – Please Read!”", "“User Obligations”", "“Content Permissions, Restrictions, and Creative Commons Licensing”", "“Disclaimer of Warranties”", "“Indemnification”", "“Limitation of Liability”", "Digital Millennium Copyright Act", "https://lumendatabase.org/", "https://lumendatabase.org/", "dmca@stackoverflow.com", "Stack Overflow", "Questions", "Help", "Products", "Teams", "Advertising", "Collectives", "Talent", "Company", "About", "Press", "Work Here", "Legal", "Privacy Policy", "Terms of Service", "Contact Us", "Cookie Settings", "Cookie Policy", "Stack Exchange Network", "Technology", "Culture & recreation", "Life & arts", "Science", "Professional", "Business", "API", "Data", "Blog", "Facebook", "Twitter", "LinkedIn", "Instagram", "CC BY-SA", "Cookie Policy"], "div": ["Loading…", "Home", "Tags", "Users", "Companies", "Collectives", "Teams", "Teams", "Create free Team", "Stack Overflow for Teams Terms of Service", "Advertising Terms of Service", ""], "h3": ["your communities", "1. Public Network Terms", "2. Contracts are Binding and Legally Enforceable -- Please Read!", "3. Age Eligibility", "4. Access to the Public Network", "5. User Obligations", "6. Content Permissions, Restrictions, and Creative Commons Licensing", "7. Disclaimer of Warranties", "8. Indemnification", "9. Limitation of Liability", "10. General Provisions", "11. Copyright policy"], "li": ["Sign up", "Public", "Public Network Terms", "Contracts are Binding and Legally Enforcable  – Please Read!", "Age Eligibility", "Access to the Public Network", "User Obligations", "Content Permissions, Restrictions, and Creative Commons Licensing", "Disclaimer of Warranties", "Indemnification", "Limitation of Liability", "General Provisions", "Copyright policy", "To access some of the public Network features you will need to register for an account as an individual and consent to these Public Network Terms. If you do not consent to these Public Network Terms, Stack Overflow reserves the right to refuse, suspend or terminate your access to the public Network.", "You are solely responsible for obtaining and maintaining any equipment or ancillary services needed to connect to or access the Network or otherwise use the Services, including without limitation modems, hardware, software, and long distance or local telephone service. You are solely responsible for ensuring that such equipment or ancillary services are compatible with the Services and Network.", "Some premium or additional features of Stack Overflow (including without limitation Stack Overflow for Teams) may require a payment obligation for access and use. You are solely responsible for ensuring that your payment obligations, if any, remain current and not in arrears. In the event Stack Overflow charges for features you will be clearly notified of the terms of any payment obligations and provided the opportunity to refuse such obligations before you incur any charges. Please note, however, that your refusal to accept payment obligations may result in your inability to access or use certain premium or additional features of Stack Overflow.", "Provide, maintain, and update the public Network", "Process lawful requests from law enforcement agencies and government agencies", "Prevent and address security incidents and data security features, support features, and to provide technical assistance as it may be required", "Aggregate data to provide product optimization", "Identification, including a description, of the copyrighted work or material You are claiming has been infringed.  If You are claiming infringement of multiple works, you may provide a representative list.", "Identification of the material that is claimed to be infringing, including its location and URL, with sufficient detail so that Stack Exchange is capable of finding and verifying its existence.", "Contact information about the notifying party (the Notifying Party), including company name, name of contact person, mailing address, telephone number and e-mail address.", "A statement that the Notifying Party has a good faith belief that the material is not authorized by the copyright owner, its agent or law.", "A statement made under penalty of perjury that the information provided in the notice is accurate and that the Notifying Party is authorized to make the complaint on behalf of the copyright owner.", "The Notifying Party's physical or electronic signature.", "Disable access to or remove material that it has a reasonable, good faith belief is copyrighted material that has been illegally copied and distributed by any subscriber to the Network.", "Stack Exchange will then immediately notify the subscriber responsible for the allegedly infringing material (the Offending Subscriber) that it has removed or disabled access to the material.", "Stack Exchange reserves the right, at its discretion, to immediately terminate the account of any subscriber who is the subject of repeated takedown notices.", "Identification, including the specific URLs, of material that Stack Exchange has removed or to which Stack Exchange has disabled access.", "User’s name, address, telephone number, and email address.", "A statement that User consent to the jurisdiction of Federal District Court for the judicial district in which your address is located (or New York County, New York if your address is outside of the United States), and that User will accept service of process from the person who provided notification under subsection (c)(1)(C) or an agent of such person.", "The following statement: \"I swear, under penalty of perjury, that I have a good faith belief that the material was removed or disabled as a result of a mistake or misidentification of the material to be removed or disabled.\"", "User’s physical or electronic signature.", "Questions", "Help", "Teams", "Advertising", "Collectives", "Talent", "About", "Press", "Work Here", "Legal", "Privacy Policy", "Terms of Service", "Contact Us", "Cookie Settings", "Cookie Policy", "Blog", "Facebook", "Twitter", "LinkedIn", "Instagram"], "strong": ["Stack Overflow for Teams", "Teams", "Attn", "Tel", "Fax", "Email"], "h5": ["Collectives™ on Stack Overflow", "Stack Overflow", "Products", "Company", "Stack Exchange Network"], "p": ["Find centralized, trusted content and collaborate around the technologies you use most.", "Teams", "Q&A for work", "Connect and share knowledge within a single location that is structured and easy to search.", "By using our products, you agree to our Terms of Service.", "The Stack Overflow Network is a set of related Internet sites and other applications for questions and answers (also referred to herein as the “Network”), owned and operated by Stack Exchange, Inc. (“Stack Overflow”, “we” or “us”), a Delaware corporation. Stack Overflow welcomes you to the Network, the largest community of developers in the world, and invites you to participate in the community by sharing knowledge with your peers and colleagues. Like all communities, we ask that you participate in a manner that respects your fellow community members. To that end, we provide you with these terms of service to advise you of the legal obligations you assume when you engage with the Stack Overflow community or otherwise access or use the public Network or any services provided on the public Network (collectively, “Services”). These terms govern the use of the public Network (the “Public Network Terms”).", "To the extent you are accessing or using our other products on behalf of a Company or Team, including without limitation by registering for an account on behalf of a Company or Team, your use of those products (such as Stack Overflow for Teams or Stack Overflow Business) is governed by their relevant Terms and Conditions.", "PLEASE BE AWARE THAT BY USING THE PUBLIC NETWORK, EXCEPT FOR CERTAIN TYPES OF DISPUTES DESCRIBED IN THE SECTION TITLED “MANDATORY ARBITRATION” BELOW, YOU AGREE THAT ALL DISPUTES BETWEEN YOU AND US WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION.", "As stated above, these Public Network Terms constitute an agreement between Stack Overflow and you and governs your use of the public Network. These Public Network Terms do NOT govern the use of our Talent, Enterprise and other Stack Overflow products and services that are not part of the public Network. In the event of any conflict between the terms and conditions of these Public Network Terms and any such service or licensing agreements, the terms and conditions of the Public Network Terms shall prevail.", "You must be at least 13 years old to access or use the Network or Services, including without limitation to complete a Stack Overflow account registration. By accessing or using the Services or the Network in any manner, you represent and warrant that you are at least 13 years of age. If you are under 13 years old, you may not, under any circumstances or for any reason, access or use the Services or Network in any manner, and may not provide any personal information to or on the Services or Network (including, for example, a name, address, telephone number or email address).", "If you are located within the European Union, you must be at least 16 years old to access or use the Network or Services, including without limitation to complete a Stack Overflow Account Registration. By accessing or using the Services or the Network in any manner, you represent and warrant that you are at least 16 years of age. If you are under 16 years old, you may not, under any circumstances or for any reason, access or use the Services or Network in any manner, and may not provide any personal information to or on the Services or Network (including, for example, a name, address, telephone number or email address).", "Any user of the public Network is welcome to participate in community discussions, to answer questions, and to share their hard earned knowledge with public Network community participants, provided that they comply with the obligations set forth in these Public Network Terms, and to the extent that use of the public Network does not conflict with the applicable laws, rules and regulations of the user’s jurisdiction. Stack Overflow reserves the right to refuse, suspend or terminate your access to the public Network if it determines, in its sole discretion, that you have in any way violated these Public Network Terms or are otherwise ineligible to access or use the Network or Services. If your actions are determined by us to violate these Public Network Terms, Stack Overflow may, in its sole discretion, try to remediate that violation by working with you individually, but is under no obligation to do so, and if any such remediation efforts are unsuccessful (in Stack Overflow’s sole discretion), then Stack Overflow may revoke your rights to the Network. You are solely responsible for ensuring that these Public Network Terms are in compliance with all laws, rules and regulations applicable to you, and the right to access the Network or any Services is revoked where these Public Network Terms or use of the Network or any Services is prohibited or conflicts with any applicable law, rule or regulation.", "Stack Overflow will use reasonable efforts to make the public Network available 24/7/365, but from time-to-time we will have scheduled outages for maintenance purposes and other upkeep. Where feasible, we may, in our sole discretion, make efforts to inform you about any outages and report on the nature and reason for any outages that may occur in an open and transparent manner, though we are under no obligation to do so, and in any case will not be liable for any downtime.", "All materials displayed or performed on the public Network, including but not limited to text, graphics, logos, tools, photographs, images, illustrations, software or source code, audio and video, and animations (collectively “Network Content”) (other than Network Content posted by individual “Subscriber Content”) are the property of Stack Overflow and/or third parties and are protected by United States and international copyright laws (“Stack Overflow Content”).", "All trademarks, service marks, and trade names are proprietary to Stack Overflow and/or third parties and use of the Network means you agree to abide by all copyright notices, information, and restrictions contained in any Network Content accessed through the Services.", "The Network is protected by copyright as a collective work and/or compilation, pursuant to U.S. copyright laws, international covenants, and other copyright laws. Other than as expressly set forth in these Public Network Terms, you may not copy, modify, publish, transmit, upload, participate in the transfer or sale of, reproduce (except as provided in this Agreement), create derivative works based on, distribute, perform, display, or in any way exploit any of the Network Content, software, materials, or Services in whole or in part.  You may download or copy the public Network Content, and other items displayed on the public Network for download or personal use provided that you maintain all copyright and other notices contained in such Public Content.", "From time to time, Stack Overflow may make available compilations of all the Subscriber Content on the public Network (the “Creative Commons Data Dump”). The Creative Commons Data Dump is licensed under the CC BY-SA license. By downloading the Creative Commons Data Dump, you agree to be bound by the terms of that license.", "Any other downloading, copying, or storing of any public Network Content (other than Subscriber Content or content made available via the Stack Overflow API) for other than personal, noncommercial use is expressly prohibited without prior written permission from Stack Overflow or from the copyright holder identified in the copyright notice per the Creative Commons License. In the event you download software from the public Network (other than Subscriber Content or content made available by the Stack Overflow API) the software including any files, images incorporated in or generated by the software, the data accompanying the software (collectively, the “Software”) is licensed to you by Stack Overflow or third party licensors for your personal, noncommercial use, and no title to the Software shall transfer to you.  Stack Overflow or third party licensors retain full and complete title to the Software and all intellectual property rights therein.", "As stated above, by agreeing to these Public Network Terms you also agree to be bound by the terms and conditions of the Acceptable Use Policy incorporated herein, and hereby acknowledge and agree that any and all Public Content you provide to the public Network is governed by the Acceptable Use Policy.", "TO THE MAXIMUM EXTENT ALLOWED BY LAW, STACK OVERFLOW DISCLAIMS ALL WARRANTIES AND REPRESENTATIONS OF ANY KIND, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT, WHETHER EXPRESS, IMPLIED, OR STATUTORY. STACK EXCHANGE PROVIDES NO GUARANTEES THAT THE SERVICES OR NETWORK WILL FUNCTION WITHOUT INTERRUPTION OR ERRORS AND PROVIDES THE NETWORK, SERVICES, AND ANY RELATED CONTENT OR PRODUCTS SUBJECT TO THESE PUBLIC NETWORK TERMS ON AN “AS IS” BASIS.", "You will indemnify and hold Stack Overflow, its directors, officers, employees, agents, consultant, contractors, partners, vendors and service providers (including, without limitation, hosting and telecommunications providers) harmless, including costs and attorneys’ fees, from any claim or demand made by any third party due to or arising out of your access to the public Network, use of Stack Overflow products or services made available on the public Network, your violation of this Agreement, or your infringement or any third party using your account, of any intellectual property right.", "TO THE MAXIMUM EXTENT PERMITTED BY LAW, STACK OVERFLOW AND ITS AFFILIATES SHALL NOT BE LIABLE UNDER CONTRACT, TORT, STRICT LIABILITY, NEGLIGENCE OR ANY OTHER LEGAL OR EQUITABLE THEORY WITH RESPECT TO THE NETWORK OR SERVICES (I) FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, OR ANY LOSS OF DATA, OPPORTUNITIES, REPUTATION, PROFITS OR REVENUES, OR (II) FOR ANY DIRECT DAMAGES IN EXCESS OF ONE HUNDRED DOLLARS ($100) IN THE AGGREGATE, EVEN IF STACK OVERFLOW OR ITS AFFILIATES HAVE BEEN TOLD OF THE POSSIBILITY OF SUCH DAMAGE, AND EVEN IF THESE REMEDIES FAIL THEIR ESSENTIAL PURPOSE. NOTHING IN THIS LIMITATION OF LIABILITY SHALL PREVENT STACK OVERFLOW’S RIGHT TO SEEK AND OBTAIN EQUITABLE RELIEF. NOTWITHSTANDING SUCH RIGHT OF EQUITABLE RELIEF, TO THE EXTENT THAT APPLICABLE LAW DOES NOT PERMIT SUCH LIMITATION OF LIABILITY OR EXCLUSION OF LIABILITY, SUCH LIMITATION WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY LAW.", "Stack Overflow reserves the right to assign our rights and obligations under these Public Network Terms (in whole or in part) without your consent to a corporate affiliate, or in connection with a merger, acquisition, corporate restructure or reorganization, or due to the sale of all or substantially all of our assets.", "These Public Network Terms will be governed by and construed in accordance with the applicable laws of the State of New York, without giving effect to the principles of that State regarding conflicts of laws. Both you and Stack Overflow hereby irrevocably agree to the sole and exclusive personal jurisdiction of the Courts of the State of New York with respect to any action, suit, or proceeding brought by it or against it by the other party in connection with the Network or Services. Notwithstanding the foregoing, these Public Network Terms shall not prevent either party from seeking injunctive relief with respect to a violation of the confidentiality provisions and indemnification provisions contained in these Public Network Terms. The Uniform Commercial Code shall not apply to the provisions of these Public Network Terms to the fullest extent permitted by law. No shrinkwrap or click-wrap terms contained in any purchase order or any Company or Team form shall apply to or supersede these Public Network Terms. In the event of any conflict between the terms and conditions of these Public Network Terms and any such shrinkwrap or click-wrap terms, the terms and conditions of the former shall prevail.", "YOU AGREE THAT WITH RESPECT TO ALL DISPUTES BETWEEN YOU AND STACK OVERFLOW OR ITS AFFILIATES OR ITS OFFICERS, DIRECTORS, OR EMPLOYEES (WHETHER OR NOT SUCH DISPUTE INVOLVES A THIRD PARTY) WITH REGARD TO YOUR RELATIONSHIP WITH US, INCLUDING WITHOUT LIMITATION DISPUTES RELATING TO THESE PUBLIC NETWORK TERMS, YOUR USE OF THE NETWORK OR SERVICES, AND/OR RIGHTS OF PRIVACY AND/OR PUBLICITY, YOU AND STACK OVERFLOW SHALL FIRST CONSULT WITH EACH OTHER TO ATTEMPT TO RESOLVE SUCH DISPUTE IN A MANNER SATISFACTORY TO BOTH PARTIES, AND THAT IF A RESOLUTION IS NOT REACHED WITHIN NINETY (90) DAYS, THEN THE DISPUTE SHALL BE REFERRED TO AND RESOLVED BY BINDING ARBITRATION UNDER JAMS, INC.’S RULES FOR ARBITRATION OF CONSUMER-RELATED DISPUTES AND YOU AND WE HEREBY EXPRESSLY WAIVE TRIAL BY JURY; PROVIDED, HOWEVER, THAT TO THE EXTENT THAT YOU HAVE IN ANY MANNER VIOLATED OR THREATENED TO VIOLATE OUR INTELLECTUAL PROPERTY RIGHTS, WE MAY SEEK INJUNCTIVE OR OTHER APPROPRIATE RELIEF IN ANY STATE OR FEDERAL COURT IN THE STATE OF NEW YORK. DISCOVERY AND RIGHTS TO APPEAL IN ARBITRATION ARE GENERALLY MORE LIMITED THAN IN A LAWSUIT, AND OTHER RIGHTS THAT YOU AND WE WOULD HAVE IN COURT MAY NOT BE AVAILABLE IN ARBITRATION. As an alternative, you may bring your claim in your local “small claims” court, if permitted by that small claims court’s rules and if within such court’s jurisdiction, unless such action is transferred, removed or appealed to a different court. You may bring claims only on your own behalf.  Neither you nor we will participate in a class action or class-wide arbitration for any claims covered by this agreement to arbitrate. YOU ARE GIVING UP YOUR RIGHT TO PARTICIPATE AS A CLASS REPRESENTATIVE OR CLASS MEMBER ON ANY CLASS CLAIM YOU MAY HAVE AGAINST US INCLUDING ANY RIGHT TO CLASS ARBITRATION OR ANY CONSOLIDATION OF INDIVIDUAL ARBITRATIONS. You also agree not to participate in claims brought in a private or representative capacity, or consolidated claims involving another person’s account, if we are a party to the proceeding. This dispute resolution provision will be governed by the Federal Arbitration Act and not by any state law concerning arbitration. In the event JAMS, INC. is unwilling or unable to set a hearing date within one hundred and sixty (160) days of filing the case, then either we or you can elect to have the arbitration administered instead by the American Arbitration Association. Judgment on the award rendered by the arbitrator may be entered in any court having competent jurisdiction. Any provision of applicable law notwithstanding, the arbitrator will not have authority to award damages, remedies or awards that conflict with these Public Network Terms.  You agree that regardless of any statute or law to the contrary, any claim or cause of action arising out of, related to or connected with the use of the public Network or these Public Network Terms must be filed within one (1) year after such claim of action arose or be forever banned.", "You agree that, notwithstanding anything in the foregoing, any arbitration proceeding between you and us will be conducted in New York, NY, USA, that the language of the arbitration shall be in English, and that all arbitration proceedings shall be considered confidential in nature.", "If you don’t want to be bound by the arbitration and class-action waiver provisions in this section, you must notify us in writing within thirty (30) days of the date that you first accept these Public Network Terms (unless a longer period is required by applicable law), and then you must litigate any disputes against us in accordance with the “Assignment and Jurisdiction” section below. Your written notification must be mailed to us at Stack Overflow, Attn: Legal Department, 110 William Street, Floor 28, New York, NY 10038 or by email notification at team (at) stackoverflow.com. If you do not notify us in accordance with this paragraph, you agree to be bound by the terms of this section, including, without limitation, the arbitration and class-action waiver provisions, and also including such provisions in any modifications we make to these Public Network Terms after the date of your first acceptance. Such notification must include: (i) your name; (ii) your email address and mailing address; and (iii) a statement that you do not wish to resolve disputes with us through arbitration or waive your ability to participate in a class action. If we make any changes to this section (other than a change to the address at which we will receive notices or rejections of future changes to this section), you may reject any such change by sending us written notice, within thirty (30) days of the change, to the address set out in the “Notices” section. It is not necessary to send us a rejection of a future change to this section if you had properly opted out within the first thirty (30) days after you first accepted the provisions in this section. If you have not properly opted out, then by rejecting a future change, you are agreeing that you will arbitrate any dispute between us in accordance with the language of this section, as modified by any changes you did not reject. A notification sent pursuant to this paragraph solely affects these Public Network Terms; if you previously entered into other arbitration or dispute resolution agreements with us or enter into other such agreements in the future, your notification that you are opting out of the provisions in this section shall not affect the other arbitration agreements between you and us.", "Stack Overflow reserves the right, in its sole discretion, to modify or replace these Public Network Terms, as our business evolves over time and to better provide Services and Products to the Stack Overflow community, or to change, suspend, or discontinue the public Network and/or any Services or Products at any time by posting a notice on the public Network or by sending you notice via e-mail or by another appropriate means of electronic communication.", "The parties to these Public Network Terms are independent contractors and these Public Network Terms shall not be construed to constitute any agency, partnership, joint venture, or employment relationship between you and Stack Overflow. These Public Network Terms represent the entire agreement between you and Stack Overflow and supersede all prior or contemporaneous oral or written communications, proposals, and representations with respect to the public Network or Services or Products contemplated hereunder. If any provision of these Public Network Terms is held to be invalid, void, unenforceable, or contrary to public policy, that provision will be limited or eliminated to the minimum extent necessary so that the remaining provisions of these Public Network Terms shall remain and continue in full force and effect.", "Unless otherwise specified in these Public Network Terms, all notices under these Public Network Terms will be in writing and will be deemed to have been duly given when received, if personally delivered or sent by certified or registered mail, return receipt requested; when receipt is electronically confirmed, if transmitted by facsimile or e-mail; or the day after it is sent, if sent for next day delivery by recognized overnight delivery service. Electronic notices should be sent to legal@stackoverflow.com.", "Our failure to enforce any part of these Public Network Terms shall not constitute a waiver of our right to later enforce that or any other part of these Public Network Terms. Waiver of compliance in any particular instance does not mean that we will waive compliance in the future. In order for any waiver of compliance with these Public Network Terms to be binding, we must provide you with written notice of such waiver through one of our authorized representatives.", "The section and paragraph headings in these Public Network Terms are for convenience only and shall not affect their interpretation.", "After the Designated Agent receives notification of an alleged infringement that meets all of the requirements above, Stack Exchange shall:", "Upon receipt of a counterclaim, Stack Exchange will forward it to the party who submitted the original copyright infringement claim. The original complainant will then have 10 days to notify us that he or she has filed legal action relating to the allegedly infringing material. If Stack Exchange does not receive any such notification within 10 days, we may restore the material to the Network.", "Your privacy"], "h2": ["Public Network Terms of Service"], "h4": ["Stack Overflow Content", "Subscriber Content", "a. Assignment and Jurisdiction", "b. Mandatory Arbitration", "c. Survival", "d. Modifications", "e. Merger and Severability", "f. Notices", "g. No Waiver", "h. Headings", "Reporting Copyright Infringements", "Filing Copyright Counterclaims", "Designated Agent"], "footer": ["Last update: January 12, 2022"], "button": ["Accept all cookies", "Necessary cookies only", "Customize settings"]}